; domain
; This domain adds to the latest domain from all-cost and has the following characteristics:
; is for transporting cargo from location to location using planes and trucks.
; has a cost for every action
; Keeps track of time using static predicates 
; uses similar technique of time to keep track of capacity levels (code idea from IPC 2014 domain) 

(define(domain capacity-transport)

    (:requirements :action-costs :typing)

    (:predicates

        (in ?object ?location)
        (at ?object ?location)
        (location ?location)
        (cargo ?object)
        (plane ?object)
        (airport ?object)
        (truck ?object)
        (day-to-day ?day1 ?day2) ; day-to-day is a static predicate that keeps track of time for the actions fly and drive 
        (current_time ?day1) ; keeps track of the current time

        ; capcaity predicates
        ; the capacity of a vehicle in a hierarchical way
        ; each x represents a capacity level
        (capacity ?vehicle ?x1)
        ; indicates that one capacity level is a lower capacity than another
        (capacity-counter ?x1 ?x2)

    )

    (:functions
        ; function to keep track of costs
        (total-cost) - number
    )
    ; loads cargo to the plane.
    ; the action load has a cost of 2 units
    (:action load
        :parameters (?cargo ?plane ?airport ?x1 ?x2)
        :precondition (and (at ?cargo ?airport)
            (at ?plane ?airport)
            (cargo ?cargo)
            (plane ?plane)
            (airport ?airport)
            (capacity-counter ?x1 ?x2)
            (capacity ?plane ?x2)
        )
        :effect (and (not (at ?cargo ?airport))
            (in ?cargo ?plane)
            (capacity ?plane ?x1)
            (not (capacity ?plane ?x2))
            (increase (total-cost) 2))
    )
    ; unloads cargo from the plane to the airport
    ; the action unload has a cost of 2 units
    (:action unload
        :parameters (?cargo ?plane ?airport ?x1 ?x2)
        :precondition (and (in ?cargo ?plane)
            (at ?plane ?airport)
            (cargo ?cargo)
            (plane ?plane)
            (airport ?airport)
            (capacity-counter ?x1 ?x2)
            (capacity ?plane ?x1)
        )
        :effect (and (not (in ?cargo ?plane))
            (at ?cargo ?airport)
            (capacity ?plane ?x2)
            (not (capacity ?plane ?x1))
            (increase (total-cost) 2))
    )
    ; fly from ariport to another airport
    ; this action uses day-to-day predicate and populate it, in other words the action takes on day to complete.
    ; sets the current time has to be specifed in init state and one of the effects of fly action is to set the current time to next day.
    ; the action fly has a cost of 5 units  
    (:action fly
        :parameters (?plane ?from ?to ?day1 ?day2)
        :precondition (and
            (at ?plane ?from)
            (plane ?plane)
            (airport ?from)
            (airport ?to)
            (current_time ?day1)
            (day-to-day ?day1 ?day2)
        )
        :effect (and
            (not (at ?plane ?from))
            (at ?plane ?to)
            (increase (total-cost) 5)
            (not (current_time ?day1))
            (current_time ?day2)
        )
    )
    ; drive from location to location
    ; this action uses day-to-day and current-time just like fly action above
    ; the action drive has a cost of 3 units 
    (:action drive
        :parameters (?truck ?from ?to ?day1 ?day2)
        :precondition (and(at ?truck ?from)
            (truck ?truck)
            (location ?from)
            (location ?to)
            (current_time ?day1)
            (day-to-day ?day1 ?day2)
        )
        :effect (and
            (not (At ?truck ?from))
            (at ?truck ?to)
            (increase (total-cost) 3)
            (not (current_time ?day1))
            (current_time ?day2)
        )
    )
    ; pick-up cargo from a location and put on the truck 
    ; the action has a cost of 1 unit
    (:action pick-up
        :parameters (?cargo ?truck ?location ?x1 ?x2)
        :precondition (and (at ?cargo ?location)
            (at ?cargo ?location)
            (at ?truck ?location)
            (cargo ?cargo)
            (truck ?truck)
            (Location ?location)
            (capacity-counter ?x1 ?x2)
            (capacity ?truck ?x2)
        )
        :effect (and
            (not (at ?cargo ?location))
            (in ?cargo ?truck)
            (capacity ?truck ?x1)
            (not (capacity ?truck ?x2))
            (increase (total-cost) 1)
        )
    )
    ; drop cargo from the truck to the location
    ; the action has a cost of 1 unit
    (:action drop
        :parameters (?cargo ?truck ?location ?x1 ?x2)
        :precondition (and (in ?cargo ?truck)
            (at ?truck ?location)
            (cargo ?cargo)
            (truck ?truck)
            (location ?location)
            (capacity-counter ?x1 ?x2)
            (capacity ?truck ?x1)
        )
        :effect (and
            (not (in ?cargo ?truck))
            (at ?cargo ?location)
            (capacity ?truck ?x2)
            (not (capacity ?truck ?x1))
            (increase (total-cost) 1)
        )
    )
)

; problem
;;Templated problem using jinja2 for learning purposes only 

(define (problem Problem2)
    (:domain capacity-transport)

    (:objects

        cargo1 cargo2 cargo3 cargo4 plane1 plane2 truck1 truck2 London Egham Tokyo Shiraz d1 d2 d3 d4 d5 d6 x0 x1 x2 x3 x4 x5 x6

    )

    (:init

        (= (total-cost) 0)

        (current_time d1)

        (day-to-day d1 d2)
        
        (day-to-day d2 d3)

        (day-to-day d3 d4)

        (day-to-day d4 d5)
        
        (day-to-day d5 d6)
    
        (Cargo cargo1)

        (Cargo cargo2)

        (Cargo cargo3)
        
        (Cargo cargo4)

        (Plane plane1)

        (Plane plane2)

        (Truck truck1)

        (Truck truck2)

        (Location London)

        (Location Egham)

        (Location Tokyo)

        (Location Shiraz)

        (Airport London)

        (Airport Egham)

        (Airport Tokyo)

        (Airport Shiraz)

        (At cargo1 London)

        (At truck1 London)

        (At truck2 Egham)

        (At cargo4 Egham)

        (At plane1 Tokyo)

        (At cargo2 Tokyo)

        (At cargo3 Shiraz)

        (At plane2 Shiraz)

        (capacity-counter x0 x1)

        (capacity-counter x1 x2)

        (capacity-counter x2 x3)

        (capacity-counter x3 x4)

        (capacity-counter x4 x5)

        (capacity-counter x5 x6)

        (capacity truck1 x5)

        (capacity truck2 x3)

        (capacity plane1 x1) ; max level capacity 
        
        (capacity plane2 x3)

    )

    (:goal

        (and (At cargo3 Tokyo) (At cargo4 London) (At cargo1 Egham) (At cargo2 Shiraz))

    )
)

; plan
1. (load cargo3 plane2 shiraz x2 x3)
   deleted: (at cargo3 shiraz) (capacity plane2 x3)
   added: (in cargo3 plane2) (capacity plane2 x2)
   goals met: 0 of 4
2. (fly plane2 shiraz tokyo d1 d2)
   deleted: (at plane2 shiraz) (current_time d1)
   added: (at plane2 tokyo) (current_time d2)
   goals met: 0 of 4
3. (unload cargo3 plane2 tokyo x2 x3)
   deleted: (in cargo3 plane2) (capacity plane2 x2)
   added: (at cargo3 tokyo) (capacity plane2 x3)
   goals met: 1 of 4
4. (load cargo2 plane1 tokyo x0 x1)
   deleted: (at cargo2 tokyo) (capacity plane1 x1)
   added: (in cargo2 plane1) (capacity plane1 x0)
   goals met: 1 of 4
5. (fly plane1 tokyo shiraz d2 d3)
   deleted: (at plane1 tokyo) (current_time d2)
   added: (at plane1 shiraz) (current_time d3)
   goals met: 1 of 4
6. (unload cargo2 plane1 shiraz x0 x1)
   deleted: (in cargo2 plane1) (capacity plane1 x0)
   added: (at cargo2 shiraz) (capacity plane1 x1)
   goals met: 2 of 4
7. (pick-up cargo4 truck2 egham x2 x3)
   deleted: (at cargo4 egham) (capacity truck2 x3)
   added: (in cargo4 truck2) (capacity truck2 x2)
   goals met: 2 of 4
8. (drive truck2 egham london d3 d4)
   deleted: (at truck2 egham) (current_time d3)
   added: (at truck2 london) (current_time d4)
   goals met: 2 of 4
9. (drop cargo4 truck2 london x2 x3)
   deleted: (in cargo4 truck2) (capacity truck2 x2)
   added: (at cargo4 london) (capacity truck2 x3)
   goals met: 3 of 4
10. (pick-up cargo1 truck1 london x4 x5)
   deleted: (at cargo1 london) (capacity truck1 x5)
   added: (in cargo1 truck1) (capacity truck1 x4)
   goals met: 3 of 4
11. (drive truck1 london egham d4 d5)
   deleted: (at truck1 london) (current_time d4)
   added: (at truck1 egham) (current_time d5)
   goals met: 3 of 4
12. (drop cargo1 truck1 egham x4 x5)
   deleted: (in cargo1 truck1) (capacity truck1 x4)
   added: (at cargo1 egham) (capacity truck1 x5)
   goals met: 4 of 4
